{
  "en": {
    "title": "HealthWise AI",
    "welcome": "Welcome to Sehat Saathi",
    "tagline": "“Sehat ki sahi jaankari, Swasth jeevan ka sathi”",
    "symptoms": "Your Symptoms",
    "symptoms_description": "This tool provides general health information, not a medical diagnosis. Please consult a qualified doctor for medical advice.",
    "check_symptoms": "Check Symptoms",
    "analyzing": "Analyzing...",
    "symptoms_placeholder": "e.g., I have a high fever, a persistent cough, and a runny nose...",
    "symptoms_error": "Please describe your symptoms in at least 10 characters.",
    "possible_causes": "Possible Causes",
    "disclaimer": "Disclaimer: This is an AI-generated list and not a substitute for professional medical advice. Please consult a healthcare provider for any health concerns.",
    "alerts": "Real-Time Health Alerts",
    "alerts_description": "Stay informed about health advisories and outbreaks in your area.",
    "flu": "Flu Season Peak",
    "dengue": "Dengue Outbreak",
    "measles": "Measles Cluster",
    "heatwave": "Heatwave Advisory",
    "flu_desc": "An increase in influenza cases has been reported nationwide. Ensure you are vaccinated.",
    "dengue_desc": "Mosquito-borne dengue fever cases are on the rise. Eliminate stagnant water sources.",
    "measles_desc": "A small cluster of measles has been identified. Check vaccination status for children.",
    "heatwave_desc": "Temperatures are expected to be higher than usual. Stay hydrated and avoid outdoor activities during peak hours.",
    "area": "Area",
    "national": "National",
    "semi_urban": "Semi-Urban Regions",
    "rural_district": "Rural District X",
    "all_regions": "All Regions",
    "lang_english": "English",
    "lang_hindi": "हिन्दी"
  },
  "hi": {
    "title": "हेल्थवाइस एआई",
    "welcome": "सेहत साथी में आपका स्वागत है",
    "tagline": "“सेहत की सही जानकारी, स्वस्थ जीवन का साथी”",
    "symptoms": "आपके लक्षण",
    "symptoms_description": "यह उपकरण सामान्य स्वास्थ्य जानकारी प्रदान करता है, न कि चिकित्सा निदान। कृपया चिकित्सकीय सलाह के लिए एक योग्य चिकित्सक से परामर्श करें।",
    "check_symptoms": "लक्षणों की जाँच करें",
    "analyzing": "विश्लेषण हो रहा है...",
    "symptoms_placeholder": "जैसे, मुझे तेज बुखार, लगातार खांसी और बहती नाक है...",
    "symptoms_error": "कृपया अपने लक्षणों का कम से कम 10 अक्षरों में वर्णन करें।",
    "possible_causes": "संभावित कारण",
    "disclaimer": "अस्वीकरण: यह एक एआई-जनित सूची है और पेशेवर चिकित्सा सलाह का विकल्प नहीं है। कृपया किसी भी स्वास्थ्य संबंधी चिंता के लिए स्वास्थ्य सेवा प्रदाता से परामर्श करें।",
    "alerts": "रीयल-टाइम स्वास्थ्य अलर्ट",
    "alerts_description": "अपने क्षेत्र में स्वास्थ्य सलाह और प्रकोपों के बारे में सूचित रहें।",
    "flu": "फ़्लू का चरम मौसम",
    "dengue": "डेंगू का प्रकोप",
    "measles": "खसरे का समूह",
    "heatwave": "लू की चेतावनी",
    "flu_desc": "देश भर में इन्फ्लूएंजा के मामलों में वृद्धि दर्ज की गई है। सुनिश्चित करें कि आपने टीका लगवा लिया है।",
    "dengue_desc": "मच्छर जनित डेंगू बुखार के मामले बढ़ रहे हैं। रुके हुए पानी के स्रोतों को खत्म करें।",
    "measles_desc": "खसरे का एक छोटा समूह पाया गया है। बच्चों के टीकाकरण की स्थिति की जाँच करें।",
    "heatwave_desc": "तापमान सामान्य से अधिक रहने की उम्मीद है। हाइड्रेटेड रहें और पीक घंटों के दौरान बाहरी गतिविधियों से बचें।",
    "area": "क्षेत्र",
    "national": "राष्ट्रीय",
    "semi_urban": "अर्ध-शहरी क्षेत्र",
    "rural_district": "ग्रामीण जिला एक्स",
    "all_regions": "सभी क्षेत्र",
    "lang_english": "English",
    "lang_hindi": "हिन्दी"
  }
}
