{
  "en": {
    "title": "HealthWise AI",
    "welcome": "Welcome to Sehat Saathi",
    "tagline": "“Sehat ki sahi jaankari, Swasth jeevan ka sathi”",
    "lang_english": "English",
    "lang_hindi": "हिन्दी",

    "symptoms": "Your Symptoms",
    "symptoms_description": "This tool provides general health information, not a medical diagnosis. Please consult a qualified doctor for medical advice.",
    "check_symptoms": "Check Symptoms",
    "analyzing": "Analyzing...",
    "symptoms_placeholder": "e.g., I have a high fever, a persistent cough, and a runny nose...",
    "symptoms_error": "Please describe your symptoms in at least 10 characters.",
    "possible_causes": "Possible Causes",
    "disclaimer": "Disclaimer: This is an AI-generated list and not a substitute for professional medical advice. Please consult a healthcare provider for any health concerns.",

    "alerts": "Real-Time Health Alerts",
    "alerts_description": "Stay informed about health advisories and outbreaks in your area.",
    "area": "Area",
    "tip": "Tip",
    "source": "Source",
    "flu": "Flu Season Peak",
    "dengue": "Dengue Outbreak",
    "measles": "Measles Cluster",
    "heatwave": "Heatwave Advisory",
    "flu_desc": "An increase in influenza cases has been reported nationwide. Ensure you are vaccinated.",
    "dengue_desc": "Mosquito-borne dengue fever cases are on the rise. Eliminate stagnant water sources.",
    "measles_desc": "A small cluster of measles has been identified. Check vaccination status for children.",
    "heatwave_desc": "Temperatures are expected to be higher than usual. Stay hydrated and avoid outdoor activities during peak hours.",
    "flu_tip": "Practice good respiratory hygiene (cover coughs/sneezes), and avoid close contact with sick individuals.",
    "dengue_tip": "Use mosquito repellents, wear long sleeves, and eliminate stagnant water around your home to reduce mosquito breeding.",
    "measles_tip": "Ensure children are fully vaccinated with the MMR vaccine and avoid exposure to individuals showing measles symptoms.",
    "heatwave_tip": "Drink plenty of water, wear light clothing, and stay in the shade during the hottest parts of the day.",
    "flu_source": "WHO Influenza Updates",
    "dengue_source": "Govt. Health Data (IDSP)",
    "measles_source": "District Health Office",
    "heatwave_source": "IMD Weather Reports",
    "national": "National",
    "semi_urban": "Semi-Urban Regions",
    "rural_district": "Rural District X",
    "all_regions": "All Regions",

    "lifestyle_title": "Healthy Lifestyle Tips",
    "lifestyle_children_title": "Children (0–12 yrs)",
    "lifestyle_children_tip1": "Eat healthy food (fruits, veggies, milk).",
    "lifestyle_children_tip2": "Play and stay active every day.",
    "lifestyle_children_tip3": "Wash hands and brush teeth daily.",
    "lifestyle_adults_title": "Adults (13–59 yrs)",
    "lifestyle_adults_tip1": "Exercise at least 30 minutes daily.",
    "lifestyle_adults_tip2": "Eat a balanced diet and drink enough water.",
    "lifestyle_adults_tip3": "Sleep 7–8 hours and manage stress.",
    "lifestyle_seniors_title": "Older Adults (60+ yrs)",
    "lifestyle_seniors_tip1": "Do light exercise like walking.",
    "lifestyle_seniors_tip2": "Eat soft, nutritious meals.",
    "lifestyle_seniors_tip3": "Get regular health checkups.",

    "preventive_title": "Preventive Care Information",
    "preventive_description": "Simple steps you can take to protect your health and prevent diseases.",
    "read_more": "Read More",
    "preventive_hygiene_title": "Practice Good Hand Hygiene",
    "preventive_hygiene_content": "Wash your hands frequently with soap and water for at least 20 seconds, especially after being in public places, or after blowing your nose, coughing, or sneezing. If soap and water are not readily available, use a hand sanitizer that contains at least 60% alcohol.",
    "preventive_hygiene_tip": "A simple hand wash can prevent a majority of infections.",
    "preventive_diet_title": "Maintain a Healthy Diet",
    "preventive_diet_content": "Eat a balanced diet rich in fruits, vegetables, whole grains, and lean proteins. A healthy diet helps boost your immune system and provides the energy you need to stay active and fight off infections.",
    "preventive_diet_tip": "Eating colorful fruits and vegetables ensures you get a wide range of nutrients.",
    "preventive_activity_title": "Stay Physically Active",
    "preventive_activity_content": "Engage in regular physical activity. Aim for at least 30 minutes of moderate-intensity exercise most days of the week. Exercise can help improve your overall health and well-being, and strengthen your immune system.",
    "preventive_activity_tip": "Even a brisk 30-minute walk daily can make a huge difference.",

    "vaccine_title": "Vaccination Timeline",
    "vaccine_description": "A general vaccination schedule. Always consult a doctor for a personalized plan.",
    "vaccine_recommended": "Recommended Vaccines:",
    "vaccine_stage_birth": "At Birth",
    "vaccine_stage_birth_vaccines": ["BCG (Tuberculosis)", "Hepatitis B", "Polio (OPV)"],
    "vaccine_stage_weeks": "6-14 Weeks",
    "vaccine_stage_weeks_vaccines": ["Polio (OPV)", "Pentavalent (DTP, Hib, Hep B)"],
    "vaccine_stage_months": "9-12 Months",
    "vaccine_stage_months_vaccines": ["Measles, Mumps, Rubella (MMR)"],
    "vaccine_stage_adults": "Teenagers & Adults",
    "vaccine_stage_adults_vaccines": ["Tetanus and Diphtheria (Td)"],

    "faq_title": "Frequently Asked Questions",
    "faq_q1": "What should I do if my symptoms are severe?",
    "faq_a1": "If you are experiencing severe symptoms such as difficulty breathing, chest pain, or loss of consciousness, please seek immediate medical attention by calling your local emergency number or visiting the nearest hospital. This tool is for informational purposes only and not a substitute for professional medical advice.",
    "faq_q2": "How accurate is the symptom checker?",
    "faq_a2": "The symptom checker is an AI-powered tool designed to provide potential health concerns based on the symptoms you provide. <strong class='text-primary'>It is not a diagnostic tool and should not be used as a substitute for a consultation with a qualified healthcare professional.</strong> The accuracy depends on the information you provide and the underlying data.",
    "faq_q3": "Is my data private?",
    "faq_a3": "We take your privacy seriously. The information you provide is used to give you health information and is not shared with third parties without your consent. Please review our privacy policy for more details.",

    "contact_title": "Get Health Info on the Go",
    "contact_description": "Access HealthWise AI through your favorite messaging apps.",
    "contact_whatsapp": "Chat on WhatsApp",
    "contact_sms": "Use via SMS",

    "footer_trust": "Trusted by Doctors",
    "footer_rights": "HealthWise AI. All rights reserved."
  },
  "hi": {
    "title": "हेल्थवाइस एआई",
    "welcome": "सेहत साथी में आपका स्वागत है",
    "tagline": "“सेहत की सही जानकारी, स्वस्थ जीवन का साथी”",
    "lang_english": "English",
    "lang_hindi": "हिन्दी",

    "symptoms": "आपके लक्षण",
    "symptoms_description": "यह उपकरण सामान्य स्वास्थ्य जानकारी प्रदान करता है, न कि चिकित्सा निदान। कृपया चिकित्सकीय सलाह के लिए एक योग्य चिकित्सक से परामर्श करें।",
    "check_symptoms": "लक्षणों की जाँच करें",
    "analyzing": "विश्लेषण हो रहा है...",
    "symptoms_placeholder": "जैसे, मुझे तेज बुखार, लगातार खांसी और बहती नाक है...",
    "symptoms_error": "कृपया अपने लक्षणों का कम से कम 10 अक्षरों में वर्णन करें।",
    "possible_causes": "संभावित कारण",
    "disclaimer": "अस्वीकरण: यह एक एआई-जनित सूची है और पेशेवर चिकित्सा सलाह का विकल्प नहीं है। कृपया किसी भी स्वास्थ्य संबंधी चिंता के लिए स्वास्थ्य सेवा प्रदाता से परामर्श करें।",

    "alerts": "रीयल-टाइम स्वास्थ्य अलर्ट",
    "alerts_description": "अपने क्षेत्र में स्वास्थ्य सलाह और प्रकोपों के बारे में सूचित रहें।",
    "area": "क्षेत्र",
    "tip": "सलाह",
    "source": "स्रोत",
    "flu": "फ़्लू का चरम मौसम",
    "dengue": "डेंगू का प्रकोप",
    "measles": "खसरे का समूह",
    "heatwave": "लू की चेतावनी",
    "flu_desc": "देश भर में इन्फ्लूएंजा के मामलों में वृद्धि दर्ज की गई है। सुनिश्चित करें कि आपने टीका लगवा लिया है।",
    "dengue_desc": "मच्छर जनित डेंगू बुखार के मामले बढ़ रहे हैं। रुके हुए पानी के स्रोतों को खत्म करें।",
    "measles_desc": "खसरे का एक छोटा समूह पाया गया है। बच्चों के टीकाकरण की स्थिति की जाँच करें।",
    "heatwave_desc": "तापमान सामान्य से अधिक रहने की उम्मीद है। हाइड्रेटेड रहें और पीक घंटों के दौरान बाहरी गतिविधियों से बचें।",
    "flu_tip": "अच्छी श्वसन स्वच्छता का अभ्यास करें (खांसी/छींक को ढकें), और बीमार व्यक्तियों के निकट संपर्क से बचें।",
    "dengue_tip": "मच्छर निरोधकों का प्रयोग करें, लंबी आस्तीन के कपड़े पहनें, और मच्छरों के प्रजनन को कम करने के लिए अपने घर के आसपास रुके हुए पानी को खत्म करें।",
    "measles_tip": "सुनिश्चित करें कि बच्चों को एमएमआर वैक्सीन के साथ पूरी तरह से टीका लगाया गया है और खसरे के लक्षण दिखाने वाले व्यक्तियों के संपर्क से बचें।",
    "heatwave_tip": "खूब पानी पिएं, हल्के कपड़े पहनें और दिन के सबसे गर्म समय में छाया में रहें।",
    "flu_source": "डब्ल्यूएचओ इन्फ्लुएंजा अपडेट",
    "dengue_source": "सरकारी स्वास्थ्य डेटा (आईडीएसपी)",
    "measles_source": "जिला स्वास्थ्य कार्यालय",
    "heatwave_source": "आईएमडी मौसम रिपोर्ट",
    "national": "राष्ट्रीय",
    "semi_urban": "अर्ध-शहरी क्षेत्र",
    "rural_district": "ग्रामीण जिला एक्स",
    "all_regions": "सभी क्षेत्र",

    "lifestyle_title": "स्वस्थ जीवन शैली युक्तियाँ",
    "lifestyle_children_title": "बच्चे (0-12 वर्ष)",
    "lifestyle_children_tip1": "स्वस्थ भोजन खाएं (फल, सब्जियां, दूध)।",
    "lifestyle_children_tip2": "रोज खेलें और सक्रिय रहें।",
    "lifestyle_children_tip3": "रोज हाथ धोएं और दांत साफ करें।",
    "lifestyle_adults_title": "वयस्क (13-59 वर्ष)",
    "lifestyle_adults_tip1": "रोजाना कम से कम 30 मिनट व्यायाम करें।",
    "lifestyle_adults_tip2": "संतुलित आहार लें और पर्याप्त पानी पिएं।",
    "lifestyle_adults_tip3": "7-8 घंटे सोएं और तनाव का प्रबंधन करें।",
    "lifestyle_seniors_title": "बुजुर्ग (60+ वर्ष)",
    "lifestyle_seniors_tip1": "चलने जैसा हल्का व्यायाम करें।",
    "lifestyle_seniors_tip2": "नरम, पौष्टिक भोजन खाएं।",
    "lifestyle_seniors_tip3": "नियमित स्वास्थ्य जांच कराएं।",

    "preventive_title": "निवारक देखभाल की जानकारी",
    "preventive_description": "सरल कदम जो आप अपने स्वास्थ्य की रक्षा और बीमारियों को रोकने के लिए उठा सकते हैं।",
    "read_more": "और पढ़ें",
    "preventive_hygiene_title": "अच्छी हाथ स्वच्छता का अभ्यास करें",
    "preventive_hygiene_content": "अपने हाथों को साबुन और पानी से कम से कम 20 सेकंड के लिए बार-बार धोएं, खासकर सार्वजनिक स्थानों पर रहने के बाद, या अपनी नाक बहने, खांसने या छींकने के बाद। यदि साबुन और पानी आसानी से उपलब्ध नहीं हैं, तो कम से कम 60% अल्कोहल वाले हैंड सैनिटाइज़र का उपयोग करें।",
    "preventive_hygiene_tip": "एक साधारण हाथ धोना अधिकांश संक्रमणों को रोक सकता है।",
    "preventive_diet_title": "एक स्वस्थ आहार बनाए रखें",
    "preventive_diet_content": "फलों, सब्जियों, साबुत अनाज और लीन प्रोटीन से भरपूर संतुलित आहार खाएं। एक स्वस्थ आहार आपकी प्रतिरक्षा प्रणाली को बढ़ावा देने में मदद करता है और आपको सक्रिय रहने और संक्रमणों से लड़ने के लिए आवश्यक ऊर्जा प्रदान करता है।",
    "preventive_diet_tip": "रंगीन फल और सब्जियां खाने से यह सुनिश्चित होता है कि आपको पोषक तत्वों की एक विस्तृत श्रृंखला मिलती है।",
    "preventive_activity_title": "शारीरिक रूप से सक्रिय रहें",
    "preventive_activity_content": "नियमित शारीरिक गतिविधि में संलग्न रहें। सप्ताह के अधिकांश दिनों में कम से-कम 30 मिनट की मध्यम-तीव्रता वाले व्यायाम का लक्ष्य रखें। व्यायाम आपके समग्र स्वास्थ्य और कल्याण को बेहतर बनाने में मदद कर सकता है, और आपकी प्रतिरक्षा प्रणाली को मजबूत कर सकता है।",
    "preventive_activity_tip": "रोजाना 30 मिनट की तेज सैर भी एक बड़ा बदलाव ला सकती है।",

    "vaccine_title": "टीकाकरण समयरेखा",
    "vaccine_description": "एक सामान्य टीकाकरण कार्यक्रम। व्यक्तिगत योजना के लिए हमेशा डॉक्टर से सलाह लें।",
    "vaccine_recommended": "अनुशंसित टीके:",
    "vaccine_stage_birth": "जन्म के समय",
    "vaccine_stage_birth_vaccines": ["बीसीजी (तपेदिक)", "हेपेटाइटिस बी", "पोलियो (ओपीवी)"],
    "vaccine_stage_weeks": "6-14 सप्ताह",
    "vaccine_stage_weeks_vaccines": ["पोलियो (ओपीवी)", "पेंटावैलेंट (डीटीपी, हिब, हेप बी)"],
    "vaccine_stage_months": "9-12 महीने",
    "vaccine_stage_months_vaccines": ["खसरा, कण्ठमाला, रूबेला (एमएमआर)"],
    "vaccine_stage_adults": "किशोर और वयस्क",
    "vaccine_stage_adults_vaccines": ["टेटनस और डिप्थीरिया (टीडी)"],

    "faq_title": "अक्सर पूछे जाने वाले प्रश्न",
    "faq_q1": "यदि मेरे लक्षण गंभीर हैं तो मुझे क्या करना चाहिए?",
    "faq_a1": "यदि आप सांस लेने में कठिनाई, सीने में दर्द, या चेतना की हानि जैसे गंभीर लक्षणों का अनुभव कर रहे हैं, तो कृपया अपने स्थानीय आपातकालीन नंबर पर कॉल करके या निकटतम अस्पताल जाकर तत्काल चिकित्सा सहायता लें। यह उपकरण केवल सूचनात्मक उद्देश्यों के लिए है और पेशेवर चिकित्सा सलाह का विकल्प नहीं है।",
    "faq_q2": "लक्षण परीक्षक कितना सटीक है?",
    "faq_a2": "लक्षण परीक्षक एक एआई-संचालित उपकरण है जिसे आपके द्वारा प्रदान किए गए लक्षणों के आधार पर संभावित स्वास्थ्य चिंताओं को प्रदान करने के लिए डिज़ाइन किया गया है। <strong class='text-primary'>यह एक नैदानिक उपकरण नहीं है और इसे एक योग्य स्वास्थ्य देखभाल पेशेवर के साथ परामर्श के विकल्प के रूप में उपयोग नहीं किया जाना चाहिए।</strong> सटीकता आपके द्वारा प्रदान की गई जानकारी और अंतर्निहित डेटा पर निर्भर करती है।",
    "faq_q3": "क्या मेरा डेटा निजी है?",
    "faq_a3": "हम आपकी गोपनीयता को गंभीरता से लेते हैं। आपके द्वारा प्रदान की गई जानकारी का उपयोग आपको स्वास्थ्य जानकारी देने के लिए किया जाता है और आपकी सहमति के बिना तीसरे पक्ष के साथ साझा नहीं किया जाता है। अधिक जानकारी के लिए कृपया हमारी गोपनीयता नीति की समीक्षा करें।",

    "contact_title": "चलते-फिरते स्वास्थ्य जानकारी प्राप्त करें",
    "contact_description": "अपने पसंदीदा मैसेजिंग ऐप के माध्यम से हेल्थवाइज एआई तक पहुंचें।",
    "contact_whatsapp": "व्हाट्सएप पर चैट करें",
    "contact_sms": "एसएमएस के माध्यम से उपयोग करें",
    
    "footer_trust": "डॉक्टरों द्वारा विश्वसनीय",
    "footer_rights": "हेल्थवाइस एआई। सर्वाधिकार सुरक्षित।"
  }
}
